In [1]:
import pandas as pd
import numpy as np

In [8]:
top_researchers = pd.read_csv('data/top_researchers_by_projects.csv')

In [9]:
top_researchers.head()

   Unnamed: 0  institution_id  person_id  project_count  person_gender_index
0           0          5000.0    1416717              1                  NaN
1           1          5000.0  207511689              1                  NaN
2           2          5000.0  179128865              1                  NaN
3           3          5000.0    1795238              2                  NaN
4           4          5000.0    1684643              2                  NaN

In [10]:
researcher_data = pd.read_csv('data/reduced_data_person.csv')

In [11]:
researcher_data.head()

,Unnamed: 0,person_id,name,first_name,gender
0,0,1394470,professor dr. hans-werner fischer-elfert,hans-werner,NaN
1,1,257249,professor dr. jörg schimmelpfennig,jörg,NaN
2,2,1052859,professor dr. hellmut fischmeister,hellmut,M
3,3,1719351,professor dr. stefan wehmeier,stefan,M
4,4,1098634,professor dr. uwe heinlein,uwe,M

In [15]:
df = pd.merge(top_researchers,researcher_data,how='left',left_on='person_id',right_on='person_id').drop("Unnamed: 0_x",axis=1).drop("Unnamed: 0_y",axis=1)

In [17]:
df = df.astype({"institution_id": int})

In [19]:
df.head()

,institution_id,person_id,project_count,person_gender_index,name,first_name,gender
0,5000,1416717,1,NaN,dr. harald leisch,harald,M
1,5000,207511689,1,NaN,dr. katharina hartmann,katharina,F
2,5000,179128865,1,NaN,dr. francesca paola anna fabbiani,anna,F
3,5000,1795238,2,NaN,dr. ellen reister,ellen,F
4,5000,1684643,2,NaN,dr. gunter merdes,gunter,M

In [20]:
df.to_csv('data/top_researchers_by_projects_detailed.csv')